#1. Даны 2 действительных числа a и b. Получить их сумму, разность и
#произведение.

a = int(input("Введите первое число "))
b = int(input("Введите второе число "))
Summ = a + b
Rasn = a - b
Proiz = a*b
print("Сумма введенных чисел равна ", Summ)
print("Разность введенных чисел равна ", Rasn)
print("Произведение введенных чисел равно ", Proiz)