#1.	Создать строку равную третьему символу введенной строки.#

strk = str(input("Введите строку с любыми значениями: "))
new_str = strk[2]
print(new_str)